importantTakes = {"s1_SHE": 0, "s6_SHE": 2}

data =
{
  "s1_SHE": [
      [
          "Timestamp",
          "-00:00:47 to -8s",
          "-00:00:11 - 00:00",
          "00:00 - 00:01",
          "00:01 - 00:12",
          "00:13 - 00:16",
          "00:17 - 00:20",
          "00:20 - 00:24",
          "00:24 - 00:30",
          "00:31 - 00:35",
          "00:35 - 00:40",
          "00:41 - 01:04",
          "01:05 - 01:14"
      ],
      [
          "Description of Phase",
          "Preparation after seeing rehearsal",
          "Preparation in body between clapboard and \"\"Action!\"\"",
          "State of preparation to follow her rushing in",
          "Following her and staying on her as she takes off shoes",
          "Following her in a wide shot as she starts moving to window",
          "Following the male character over the shoulder as he moves towards her",
          "Responding to unexpected situation with male crossing line twice",
          "Following him to her",
          "Moving back into an over his shoulder shot towards her",
          "Staying briefly on her",
          "Moving to the left, all around them",
          "He stays focused on her having her eye open towards the ceiling"
      ],
      [
          "video_time_stamp",
          "-00:47",
          "-00:11",
          "00:00",
          "00:01",
          "00:13",
          "00:17",
          "00:20",
          "00:24",
          "00:31",
          "00:35",
          "00:41",
          "01:05"
      ],
      [
          "Thoughts",
          "Thinking how the actors move, key movements or positions where I want to be, what happens between them. Knowing that I start from here, and end here and figuring out this one point in between.",
          "Trying to remember where & what they are doing and how to first react to it\n",
          "-",
          "Trying to remember that I was trying to catch the moment when she finishes this first beat and starts to move to next position by the window.\nThinking it would be very convenient to move when she starts to move, so I wouldn’t be fully stopped.",
          "Wanting to get the male in when he enters",
          "Wanting to introduce the male this way\nWanting to create a change in the scene this way\nWanting to have them both in the shot, him in foreground, her in background\nWanting to catch the male picking up shoes\n",
          "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nIs it understandable or too confusing for the audience that I missed the shoes?\nPicking up the shoes represents the male caring, is it necessary for the scene to make the audience understand the male cares?\nWas it a bad thing I missed it, or okay?\n",
          "-",
          "-",
          "Feeling in a good position to see her face and frame",
          "-",
          "He looks for her eye\nIt's working, everything works really well together, how dop is positioned, her opening eyes, them being positioned rightly, how light fell on them"
      ],
      [
          "Other mental processes / states",
          "Letting go of thoughts\nTrusting instincts",
          "Taking his time, patiently strying to see when she starts to move\nWanting to see the room and her as much as possible when she walks in, with her in a wide shot, giving time and visual space for her big movements",
          "Time goes almost into slow-motion compared to before shooting\nState of preparation and readiness with stable camera\n200% focused so the camera follows but does not predict her movements [in the middle between following and predicting]; hiding the camera in her movements",
          "-",
          "-",
          "-",
          "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nTrusting instincts\nKnowing that happy accidents sometimes don’t feel so good during filming itself\nSeeing the male raises the nervousness of the situation, emphasises his power\n",
          "-",
          "Feeling the male is invading or dominating, trying to make her change her mind",
          "Feeling in a good position to see her face and frame",
          "-",
          "Wanting to leave the window behind them."
      ],
      [
          "Feelings / emotions",
          "Feeling a little confused because new situation\nFeeling relieved because I can do what I want, it is not an expensive movie\nTrying to feel how the actors move, key movements or positions where I want to be, what happens between them.",
          "Nice and scary fresh feeling\nKind of magic, good feeling\n",
          "-",
          "Feeling wide shot is more impactful",
          "-",
          "-",
          "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nIt's confusing in a good way (for the film)\nDisturbed\nNot very satisfied\n",
          "-",
          "-",
          "-",
          "-",
          "Feeling it is a good end for the scene\nFeeling we get to see how she really feels\nFeeling rewarding\nFeeling in partnership with her, like she is showing him what she is really feeling and thinking, which is different from what she is telling\nFeeling like she is trusting him with a secret\nFeeling the frame gives a very good understanding of the scene, even though perhaps not beautiful"
      ],
      [
          "Body actions, sensations, events",
          "Trying to feel how the actors move, key movements or positions where I want to be, what happens between them.\nTrusting instincts",
          "Bit of tingling",
          "Trying to catch the last breath\nLetting following but not predicting her movement come from instinct, not thought\n",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-"
      ],
      [
          "Actions (decisive, filming)",
          "Trying to be in partnership with her, trying to show her emotions, like helping her, someone now sees what she is going through, someone is getting emotional contact with her.",
          "Trying to be in partnership with her",
          "State of preparation and readiness with stable camera\nTrying to be in partnership with her",
          "He follows her walking in\nHe captures her in a wide shot to give time and visual space for her big movements, feels it is more impactful\nTrying to be in partnership with her",
          "He follows her in a wide shot as she walks to the window\nTrying to be in partnership with her",
          "Catching male entering\nThen going behind him, filming her over the shoulder as male walks to her\nTrying to be in partnership with her\n",
          "Unable to control the situation when male crosses line twice\nUnable to catch him picking up shoes as planned\nDeciding not to change it\nKeeping following him towards her and concentrate on her\nShowing understanding of what she is feeling\nTrying to be in partnership with her",
          "Trying to be in partnership with her",
          "Moving to the right\nCatching her more and more over his shoulder\nAt end going even closer on her\nTrying to be in partnership with her",
          "Trying to be in partnership with her",
          "Keeping them in two shot while they move closer together\nGoing even closer\n(Then staying on them, seeing his face more than hers but catching her eye from the side)\nTrying to be in partnership with her\n",
          "Showing her being detached towards him\nTrying to be in partnership with her, trying to show her emotions, like helping her, someone now sees what she is going through, someone is getting emotional contact with her.\nStill constantly trying to find the best composition or framing for this moment without ruining it, so not shaking the camera too much or going too far. \nStill trying to open her up as much as possible."
      ]
  ],
  "s6_SHE": [
    [
      "Timestamp",
      "-00:00:46 to -8s",
      "-00:00:08 - 00:00",
      "00:00 - 00:10",
      "00:10 - 00:20",
      "00:20 - 00:23",
      "00:24 - 00:26",
      "00:27 - 00:37",
      "00:38 - 1:09",
      "01:09 - 01:12",
      "01:12 - 01:21"
    ],
    [
      "Description of Phase",
      "Trying to be comfortable in body, ready for reaction",
      "Capturing her rushing in and picking up the shoes",
      "Capturing her rushing in and picking up the shoes",
      "(Her moving to the window - undescribed phase)",
      "She looks at him, following his movement with her eyes and face",
      "Blocking her accidentally, in hindsight reinforcing her being suffocated by him",
      "Catching him putting down the shoes and giving them back the space, all the while moving towards end position",
      "More freestyle phase, exploring their connection in final positions and how to end shoot",
      "Not responding to male actor looking into camera",
      "Responding to actors' surprise"
    ],
    [
      "video_time_stamp",
      "-00:46",
      "-00:08",
      "00:00",
      "00:10",
      "00:20",
      "00:24",
      "00:27",
      "00:38",
      "01:09",
      "01:12"
    ],
    [
      "Thoughts",
      "Focused on the action\nFocused on matching my movements with her movements and intentions\nImagining her movements\nSpecifically concerned about moment she takes her shoes off, which I want to capture. And how to go back up to her face after.\n[As it requires a complicated movement]",
      "-",
      "When down on the shoes, moment of doubt about when to go up\nAnticipating her reaction to male appearing\nKnowing next action I want to catch is him putting shoes on the table.",
      "-",
      "I don‚Äôt want to catch him picking up the shoes\nI want to catch him putting shoes on table",
      "Okay, now I need to rotate to her back and do it in a way that feels organic with her movements\nSo I can pan down and catch him putting the shoes on the table\nWanting to catch the flare from the window light\nWanting to use the verticality of the window to show division between them\nIn the back of his mind are religious/symbolic  imagery/ themes/ geometry\nKnowing it is going to be tricky with the space as I block her\nDeciding to still do it\nKnowing/trusting she will solve it professionally as actress",
      "Waiting for important line [Your friends don't like me]\nJust waiting for that action of the line, muting the content of the sentence\nI could be on him, but I want to be with her and see how he is approaching",
      "Not very planned\nKeeping possibiities open, also in terms of distance\nI know I am between closeup and midshot and that I am going to be between proile and 3/4 frontal of her and also want to be on him, (so I am reacting to that)\nNot thinking that I am only going to be on her\nSeeing, what is their connection?\nStarting to explore how to end the shoot\nAnd getting ready for closing part of scene.",
      "-",
      "Realising they have an agreement or indication\nI will try to reinforce this action"
    ],
    [
      "Other mental processes / states",
      "Visualising, like previewing, looking at the space, imagining her movements in it\nTrying to imagine how the object is going to be in the frame, what lines I will see in background, what I will see in background and foreground",
      "Trying to be alert, ready",
      "Knowing her picking up the shoes is coming",
      "-",
      "-",
      "Realising I am blocking her as I take long step back\nVery alert of the frame to catch a religious theme in the geometry, giving the light flare a toxic meaning, representing his power",
      "Main focus is to keep them on frame",
      "Seeing, what is their connection?\nDiscovering things (by relaxing in the body and keeping a flow of movement, and keeping moving)\nStill very alert, even more in this flow state [because I have to be responsive]\nCompletely invested in the present, what is happening in the frame. Just-past and planning next are not present\nMore concerned with having them on frame correctly under my rules of composition, than with their expressions.",
      "No surprise [it happens all the time, not surprising in itself]\nFocused on composition",
      "My concentration breaks a little [perhaps by persona of actor appearing, or the geometry]"
    ],
    [
      "Feelings / emotions",
      "-",
      "-",
      "Immediately when she comes in, I feel it works",
      "-",
      "-",
      "Feeling her confusion for a moment\nI feel she is acknowledging my presence with her body",
      "-",
      "Feeling good\nFeeling excited to discover new possibilities of a scene",
      "Didn't feel that much",
      "Did not feel surprise\nI feel I have to take distance from them"
    ],
    [
      "Body actions, sensations, events",
      "Rehearsing my movements\nImagining how it feels, the movements I would do, how low I would go with camera\nFeeling where my elbows touch my stomach, so I know this is the limit\nPhysically making movements to the window\nDeliberately hitting the table so body knows this is the limit",
      "Trying to be comfortable in the body",
      "-",
      "-",
      "I am physically very close to her",
      "Realising I am blocking her as I take long step back",
      "-",
      "Sense of flowing, keeping in movement, also in how I move the camera\nI feel it all around the body, trying to relax all muscles, the knees, the stepping, the hips, moving a little from side to side, in an out",
      "-",
      "Body translates surprise by stepping back, it is a bit like their looking pushes me back"
    ],
    [
      "Actions (decisive, filming)",
      "Exploring with the viewfinder, what I can see, and what I can see with my eyes",
      "-",
      "Starting to move at same time as her, following her\nGoing very fast down with her picking up the shoes\nWhen nothing else is happening down with the shoes, going up to her face\nTrying to go more of a profile of her in order to take her reaction when male comes in",
      "Capturing her moving to window while moving with her, catching her response up close when he enters",
      "I am physically very close to her",
      "As I rotate, I take one long step back [as I want to catch the light from the window to create a flare]\nPlaying around with the light and the division the window can give between them",
      "Catching him putting down the shoes on the table\nAll the while moving, turning with her, and stepping back, giving them back their space\nKeeping moving towards closeup twoshot he wants to take when she delivers line\nReacting to their actions\nKeeping them on frame",
      "Rotating from the corner to have them together already in similar position of the ending\nMoving back and forth\nPanning alternatively between him and her\nMore freestyling from this moment on\nPlaying a little with the action, not very planned, reacting to what I see\n(I know I am between closeup and midshot and that I am going to be between proile and 3/4 frontal of her and also want to be on him,) so I am reacting to that\nLetting things open, also in terms of distance",
      "-",
      "Deciding to take a couple of steps back, matching their action and that distance the looking at the camera represents"
    ]
  ]
}
