importantTakes = {"s1_SHE": 1, "s2_SHE": 4, "s3_HE": 3, "s4_SHE": 3, "s5_SHE": 3, "s6_SHE": 3}

data =
{
  "s1_SHE": [
    [
      "Timestamp",
      "-00:00:47 to -8s",
      "-00:00:11 - 00:00",
      "00:00 - 00:01",
      "00:01 - 00:12",
      "00:13 - 00:16",
      "00:17 - 00:20",
      "00:20 - 00:24",
      "00:24 - 00:30",
      "00:31 - 00:35",
      "00:35 - 00:40",
      "00:41 - 01:04",
      "01:05 - 01:14"
    ],
    [
      "Description of Phase",
      "Preparation after seeing rehearsal",
      "Preparation in body between clapboard and \"\"Action!\"\"",
      "State of preparation to follow her rushing in",
      "Following her and staying on her as she takes off shoes",
      "Following her in a wide shot as she starts moving to window",
      "Following the male character over the shoulder as he moves towards her",
      "Responding to unexpected situation with male crossing line twice",
      "Following him to her",
      "Moving back into an over his shoulder shot towards her",
      "Staying briefly on her",
      "Moving to the left, all around them",
      "He stays focused on her having her eye open towards the ceiling"
    ],
    [
      "video_time_stamp",
      "-00:47",
      "-00:11",
      "00:00",
      "00:01",
      "00:13",
      "00:17",
      "00:20",
      "00:24",
      "00:31",
      "00:35",
      "00:41",
      "01:05"
    ],
    [
      "Thoughts",
      "Thinking how the actors move, key movements or positions where I want to be, what happens between them. Knowing that I start from here, and end here and figuring out this one point in between.",
      "Trying to remember where & what they are doing and how to first react to it\n",
      "-",
      "Trying to remember that I was trying to catch the moment when she finishes this first beat and starts to move to next position by the window.\nThinking it would be very convenient to move when she starts to move, so I wouldn’t be fully stopped.",
      "Wanting to get the male in when he enters",
      "Wanting to introduce the male this way\nWanting to create a change in the scene this way\nWanting to have them both in the shot, him in foreground, her in background\nWanting to catch the male picking up shoes\n",
      "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nIs it understandable or too confusing for the audience that I missed the shoes?\nPicking up the shoes represents the male caring, is it necessary for the scene to make the audience understand the male cares?\nWas it a bad thing I missed it, or okay?\n",
      "-",
      "-",
      "Feeling in a good position to see her face and frame",
      "-",
      "He looks for her eye\nIt's working, everything works really well together, how dop is positioned, her opening eyes, them being positioned rightly, how light fell on them"
    ],
    [
      "Other mental processes / states",
      "Letting go of thoughts\nTrusting instincts",
      "Taking his time, patiently strying to see when she starts to move\nWanting to see the room and her as much as possible when she walks in, with her in a wide shot, giving time and visual space for her big movements",
      "Time goes almost into slow-motion compared to before shooting\nState of preparation and readiness with stable camera\n200% focused so the camera follows but does not predict her movements [in the middle between following and predicting]; hiding the camera in her movements",
      "-",
      "-",
      "-",
      "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nTrusting instincts\nKnowing that happy accidents sometimes don’t feel so good during filming itself\nSeeing the male raises the nervousness of the situation, emphasises his power\n",
      "-",
      "Feeling the male is invading or dominating, trying to make her change her mind",
      "Feeling in a good position to see her face and frame",
      "-",
      "Wanting to leave the window behind them."
    ],
    [
      "Feelings / emotions",
      "Feeling a little confused because new situation\nFeeling relieved because I can do what I want, it is not an expensive movie\nTrying to feel how the actors move, key movements or positions where I want to be, what happens between them.",
      "Nice and scary fresh feeling\nKind of magic, good feeling\n",
      "-",
      "Feeling wide shot is more impactful",
      "-",
      "-",
      "Unexpected and uncontrollable situation when male crosses the line twice as he enters and picks up shoes\nIt's confusing in a good way (for the film)\nDisturbed\nNot very satisfied\n",
      "-",
      "-",
      "-",
      "-",
      "Feeling it is a good end for the scene\nFeeling we get to see how she really feels\nFeeling rewarding\nFeeling in partnership with her, like she is showing him what she is really feeling and thinking, which is different from what she is telling\nFeeling like she is trusting him with a secret\nFeeling the frame gives a very good understanding of the scene, even though perhaps not beautiful"
    ],
    [
      "Body actions, sensations, events",
      "Trying to feel how the actors move, key movements or positions where I want to be, what happens between them.\nTrusting instincts",
      "Bit of tingling",
      "Trying to catch the last breath\nLetting following but not predicting her movement come from instinct, not thought\n",
      "-",
      "-",
      "-",
      "-",
      "-",
      "-",
      "-",
      "-",
      "-"
    ],
    [
      "Actions (decisive, filming)",
      "Trying to be in partnership with her, trying to show her emotions, like helping her, someone now sees what she is going through, someone is getting emotional contact with her.",
      "Trying to be in partnership with her",
      "State of preparation and readiness with stable camera\nTrying to be in partnership with her",
      "He follows her walking in\nHe captures her in a wide shot to give time and visual space for her big movements, feels it is more impactful\nTrying to be in partnership with her",
      "He follows her in a wide shot as she walks to the window\nTrying to be in partnership with her",
      "Catching male entering\nThen going behind him, filming her over the shoulder as male walks to her\nTrying to be in partnership with her\n",
      "Unable to control the situation when male crosses line twice\nUnable to catch him picking up shoes as planned\nDeciding not to change it\nKeeping following him towards her and concentrate on her\nShowing understanding of what she is feeling\nTrying to be in partnership with her",
      "Trying to be in partnership with her",
      "Moving to the right\nCatching her more and more over his shoulder\nAt end going even closer on her\nTrying to be in partnership with her",
      "Trying to be in partnership with her",
      "Keeping them in two shot while they move closer together\nGoing even closer\n(Then staying on them, seeing his face more than hers but catching her eye from the side)\nTrying to be in partnership with her\n",
      "Showing her being detached towards him\nTrying to be in partnership with her, trying to show her emotions, like helping her, someone now sees what she is going through, someone is getting emotional contact with her.\nStill constantly trying to find the best composition or framing for this moment without ruining it, so not shaking the camera too much or going too far. \nStill trying to open her up as much as possible."
    ]
  ],
  "s2_SHE": [
    [
      "Timestamp",
      "-00:07s - 00:00",
      "00:00 - 00:01",
      "00:01 - 00:02",
      "00:03 - 00:16",
      "00:17 - 00:21",
      "00:22 - 00:25",
      "00:25 - 00:29",
      "00:29 - 00:45",
      "00:46 - 00:52",
      "00:52 - 00:55",
      "00:56 - 01:01",
      "01:01 - 01:35",
      "01:35 - 01:43",
      "01:43 - 01:53"
    ],
    [
      "Description of Phase",
      "Preparation just before starting shooting",
      "Starting to pan from room to female, feeling immediately that is is right, and starting feeling connected with the actress",
      "Catching female character's energy as she rushes in",
      "Catching the shoes part; staying on her while moving more in front of her",
      "Panning to and catching her at the window",
      "Panning to him",
      "Panning back to female; moving into wide medium shot of both of them",
      "Keeping the frame tension of him dominating and her pressed into corner of the frame",
      "Going closer to see her face",
      "Focusing on her fist",
      "Concentrating on her",
      "Him as a cage around her",
      "Connecting with truth: she looks into camera and it works, something happens",
      "Filming final acting, getting ready for final framing"
    ],
    [
      "video_time_stamp",
      "-00:07",
      "00:00",
      "00:01",
      "00:03",
      "00:17",
      "00:22",
      "00:25",
      "00:29",
      "00:46",
      "00:52",
      "00:56",
      "01:01",
      "01:35",
      "01:43"
    ],
    [
      "Thoughts",
      "-",
      "-",
      "Thinking if I had another take, I would do it differently with the eyeline.\n",
      "Thinking about positioning myself when getting ready for her to go to the window\nWhen she goes to the window, I should not follow her too far, otherwise I will see the studio when panning to him, I don't want that.\nAlso to be ready not too pan too far, because he is only in the corner of the frame for a moment, and I could lose him for not being able to follow him. ",
      "Thinking it was a nice moment, feeling happy with his own and her move, how she was getting to the window, feeling this part has gone quite well. ",
      "-",
      "-",
      "This goes well",
      "-",
      "Thinking maybe it was okay [even though I felt missed her moving back out]",
      "-",
      "-",
      "I am hoping she is not smiling\nI am hoping she understands what we agreed, that she is looking into the camera and understands the emotion [we didn't discuss it too much although her looking was pre-planned between us]\nI try to understand if this is the right feeling for the… somehow some kind of… balancing and waiting, if this goes too much or is it… is it okay, and...\nTrying to understand if it's the right feeling [was it technically okay and was it emotionally okay?]\n This is the high point of the scene for me, for all takes, something happens in this moment, came to the right point.",
      "-"
    ],
    [
      "Other mental processes / states",
      "Getting ready for the pan so I try to avoid seeing the man too early\nFeeling ready, … -->",
      "I immediately felt with this pan that it was right.\n- right amount of empty room, and starting to feel already it is going in the right direction\n- the camera on this take didn't feel like a character or point of view. It was more giving the idea of the empty room, then her coming in.\n- it was as I had imagined doing it\n     - it was not misleading me from what I wanted to show. From the position I was given, it was the best I could use it for.\n    -In this take [unline take 3] if felt the camera is showing the room and getting her energy; it is not visible.  ",
      "-",
      "When going in front of her, feeling that maybe I went too close to her eyeline, making it a little confusing where she is looking, at someone or into the space, or into the room?\nBut the feeling was still nice.",
      "Feeling this part has gone quite well. \nWaiting for her to react to him when he is coming in.\nBe ready for the pan toward him and the move out during the pan\nHearing him moving to the corner",
      "He enters, I have some energy moving on the edge of the frame",
      "-",
      "-",
      "-",
      "It felt good\n[She moved out quickly from there] and I felt a little late following it up\nFeeling I missed it",
      "Finding them in a really nice place\nLight hitting her left eye, which is nice",
      "Having more of him in the frame than I wanted [but still it was okay]\nHe is pressing her quite close and I can only see one eye of her, which feels really nice, and that she is pressed in\nI don’t want to miss that [coming] moment of her looking into camera",
      " ...after that em… I am trying to feel if it… works, basically, that's what I'm trying to do, and I think I felt that eh… it's like, … 85 percent.\nTrying to understand if it’s the right feeling \n[This is a constant, anyway, and with everything, it's constant, some kind of checking if…, trying to step out from and eh… the technical execution and trying to concentrate on feeling, but it's constant balancing, but it's happening all the time, this switching, it’s like, I can't understand, I think, point out when is it happening, because it's always, after every move or anything, everything, anyone comes in, there's always this checking, if this was, if it was technically okay and if it was emotionally okay, did I feel it's right? Because if it's wrong, I get really frustrated immediately, so it’s eh… And it… Yeah, it might… make eh…, influence the rest of the take or eh…, so it's constantly this checking, this [inaudible]]\nThis is the high point of the scene for me, for all takes, something happens in this moment, came to the right point.",
      "Getting ready for final framing\nHappy with background, didn’t disturb too much, or I didn’t turn that much attention to them\nWaiting if anything more happens, nothing seems to\n"
    ],
    [
      "Feelings / emotions",
      "Feeling good somehow: more at ease, and I know prettig much all the things I want to have, I know my previous mistakes\nHappy to be getting to do the extra take\nExcited about the new task in the end of actors breaking 4th wall, the unknown of what is going to happen at the end with the look",
      "I immediately felt with this pan that it was right.\nBuilding connection with the actress starts in this moment. --->",
      "-",
      "But the feeling was still nice.",
      "-",
      "-",
      "-",
      "-",
      "-",
      "It felt good\nFeeling I missed her moving back out",
      "-",
      "Happy with this, with how it all felt in this moment",
      "Checking if it is emotionally okay [is checking how I am feeling. Check how you are feeling at that moment, is it true or not, does it feel true or fake, right or wrong. Does it influence you emotionally, have some emotional impact, is the impact. Secondary is if it is what was intended. \nIf it is right], it moves me somehow.\nRight is it opens some kind of door or pathway or connection:\n- A connection with truth. \n- I see it when she looks into the camera, it emanates, it is going in the right direction, I feel her need for help, and her helplessness, and at the same time her acceptance of not breaking out from his embrace, her giving up.\nThis is the high point of the scene for me, for all takes, something happens in this moment, came to the right point.\n",
      "-"
    ],
    [
      "Body actions, sensations, events",
      "Positioned in a flexed tension, ready to move forward and to be flexible and fluid with the move:\n- knees a bit bent\n- ready to take big steps\n- leaning a bit to the left where I have planned to move\n - making sure I am at eye level, approx., of the actress, not to be higher.",
      "-",
      "-",
      "While tilting lowering myself with the body so the angle of the camera would not be too steep, so going lower whilst looking down\nThen moving up again with body, getting more straight [because afraid of looking over set walls] so going a little higher but not looking down at her, still more at eye-level-ish",
      "Trying to lean in and go closer to her, going a little softer and lower with my body\nGetting behind her, lowered a tiny bit from when she was moving there.\nStill keeping a flexible tension\nBe ready for the pan toward him and the move out during the pan",
      "While panning to him, trying to pull out from her position by stepping back more so I can get wider and have more space for him to get into the shot",
      "-",
      "-",
      "Be ready to move down with my body\nBending my knees so I can crane down to her fist [idea formed to catch that during previous take]",
      "-",
      "Stretching legs more",
      "I go a little bit higher, stretching body more, almost straight\nBeing ready to raise the camera even higher, but I didn’t need it\nI push up my shoulder so see more from a higher level down, trying not to lose her eye behind the shoulder [because we agreed she would be looking into the camera at some point], and I don’t want to miss that moment of her looking into camera",
      "-",
      "My body lowered the camera a bit at same time\nI step out a bit to see more of him and the position they are in"
    ],
    [
      "Actions (decisive, filming)",
      "Framing up for the empty room\nTrying to time the pan with the actress getting into the room, so he would call her at the right moment, and I catch her with the pan with the right energy [not walking too fast, not losing energy, aiming to catch her taking off the shoes, all of which went wrong sometimes in previous takes]\nStarting move in, leaning in a little, ready to call Action...-->",
      "[Frame is showing the room towards the right window]\nDoing the bend and starting to pan [to her], as soon as he hears her steps\n",
      "Catching her energy: breaking away from this static shot of the room. [would have loved to do a mise-en-scene with camera just observing, but camera position was not right for that. Since I already had to move therefore, I decided I needed to catch her energy, and to do that, I needed to move with her]. \nStill looking to keep some mise-en-scene in this.\n",
      "Trying to go more in front of her this time to see both her eyes\nTilting down, but not too much\nWhile tilting lowering myself with the body so the angle of the camera would not be too steep, so going lower whilst looking down\nGoing up again to her face\nThen moving more in front of her, skipping the shoes\nThen moving up again with body, getting more straight [because afraid of looking over set walls] so going a little higher but not looking down at her, still more at eye-level-ish",
      "Panning to the window\nGetting behind her, lowered a tiny bit from when she was moving there.\nTrying to lean in and go closer to her, going a little softer and lower with my body\nStanding behind her, a little bit on her right side, waiting for her to react to him when he is coming in.\nStill looking at her\n-  Seeing + catching her reaction, trying to show what she is seeing\n -That moment we find out that someone else is there, so then showing who it is",
      "Panning to him, while panning, trying to pull out from her position by stepping back more so I can get wider and have more space for him to get into the shot\nCatch his move from the corner, trying to avoid the end of the set wall and avoiding seeing the empty studio.\nTrying to go back to her quickly [I don't need to see more of him but set is also not built to be able to show more of him]",
      "Moving back and panning to the left again.\nStill stepping out whilst doing that, to make space for him to get into the shot and have a wide medium shot of them together",
      "Keeping him framed in the middle and her in the corner, keeping this frame tension, trying to hold him this way\nKeep the frame out of balance, heavy towards her",
      "Moving closer to see her face\nTrying to do it quickly and be ready to move down with my body\nBending my knees so I can crane down to her fist",
      "Catching her fist before she tries to break away from the hug or before she raises (unfinished sentence)",
      "Seeing her left eye\nSeeing her face\nTrying to avoid his face, wanting to concentrate more on her\nHaving him only as body language, as a cage around her, pressing her",
      "I push up my shoulder so see more from a higher level down, trying not to lose her eye behind the shoulder [because we agreed she would be looking into the camera at some point], and I don’t want to miss that moment of her looking into camera",
      "-",
      "I step out a bit to see more of him and the position they are in\nWaiting if anything more happens, nothing seems to\nThen calling the cut."
    ]
  ],
  "s3_HE": [
    [
        "Timestamp",
        "-01:00 - minus 00:35",
        "-00:35 - minus 00:11",
        "-00:11 - 00:00",
        "00:00 - 00:06",
        "00:06 - 00:08",
        "00:09 - 00:16",
        "00:16 - 00:23",
        "00:23 - 00:27",
        "00:27 - 00:33",
        "00:33 - 00:40",
        "00:40 - 00:45",
        "00:45 - 00:52",
        "00:52 - 00:59",
        "00:59 - 01:02"
    ],
    [
        "Description of Phase",
        "Noticing a motif he wants to use",
        "Mental preparation",
        "Getting ready with camera in position",
        "Filming the male's emotion of being mentally pushed into a corner by deliberately keeping 'wrong' composition of male in corner of frame",
        "(undiscussed)\n(He moves to the left to film him over her shoulder)",
        "(undiscussed)\n(He keeps camera kind of still in the same place)",
        "Framing male moving towards and being on corner, DOP3 going closer and moving to left at same time, ending in medium shot",
        "Following the male picking up the shoes",
        "He follows male towards rough medium twoshot of them",
        "Keeping them in a rough two shot",
        "Closeup of them together",
        "Even closer closeup of them",
        "Showing hand of the male comforting the female",
        "Letting it play out for a moment"
    ],
    [
        "video_time_stamp",
        "-00:59",
        "-00:35",
        "-00:11",
        "00:00",
        "00:06",
        "00:09",
        "00:16",
        "00:23",
        "00:27",
        "00:33",
        "00:40",
        "00:45",
        "00:52",
        "00:59"
    ],
    [
        "Thoughts",
        "[He notices this very interesting motif of this guy pushed into a corner, and he felt that could be the focus of the beginning of the scene, this very still, someone pushed against the wall. As he needed to shoot from very far away from his own fixed position, he felt he could still keep the focus on that character. Because the corner was very dark, he semi-rhetorically asked for a light, which was given to him. This lighting on the male allowed for his emotions being kind of close while physically being further away.]",
        "-",
        "-",
        "Wanting to convey to the audience that the male feels mentally pushed into a corner",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "\"\"That's probably a cut\"\""
    ],
    [
        "Other mental processes / states",
        "The focus on the male from the beginning felt to him as the only way to do it so that our focus is on him. It was an intuitive choice but it seemed (in hindsight for him, or aftwards) the right one. ",
        "-",
        "-",
        "Seeing pressure through the lens\n(Knowing that) wrong composition technique is needed to make it alive and true\nStanding too far away to see what the male actually feels",
        "-",
        "-",
        "Male on corner feels like a blocking point to him [blocking points need amplifying for him]\nMale seems intrigued and excited about panicky rushing in of actress [also due to contrast with his silence before, DOP links this to musical contrast between silence and note and their value/impact being relative to the other]\nHe is reacting in an intriguing way to her\nSensing rhythm, tempo, \"\"mental clock ticking in the background\"",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Wanting to show the male's emotion, his action and reaction",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Sensing this moment as a [musical] \"\"beat\"\" (later he also describes it as a musical note compared to musical silence), yet…",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Knowing it is a short blocking point...",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "... Intuition connected to music/rhythm/tempo processes going on in back of his mind that soon he needs to start moving, so can't get into closeup even though that corresponds with the beat",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "",
        "It's like an emotion or outburst to me; not so concerned with physical reality of what he is doing with the shoes",
        "[maybe tempo is holding me back here,\nmaybe wanting to create 'silence' (in musical terms) here to create contrast with next note, creating the meaning of this next note]",
        "[maybe tempo is holding me back here,\nmaybe wanting to create 'silence' (in musical terms) here to create contrast with next note, creating the meaning of this next note]",
        "Wanting to show male's emotions\n",
        "Wanting to show male's emotions",
        "Noticing him conforting her with his hand, wanting to show that\nWanting to show male's emotions",
        "Feeling the actor cut it",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Feelings / emotions",
        "-",
        "-",
        "-",
        "Feeling unease [as he keeps a 'deliberately wrong' compositional technique, of male being tight in corner, to get the emotion of this character him being out of balance]\nFeeling claustrophobic (probably seeing this through the lens rather)\nFeeling unsatisfied [because of deliberate wrong choice]",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    [
        "Body actions, sensations, events",
        "-",
        "-",
        "-",
        "Feeling unease",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    [
        "Actions (decisive, filming)",
        "[Because the corner was very dark, he semi-rhetorically asked for a light, which was given to him.]\nTrying to film everything off-axis until the ending",
        "He asks director for a second\nHe stands still, is focused inward\n\"\"Okay, let's do it\"",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "",
        "Not much to see outwardly, camera already fixed on male; getting a little stiller physically, then calling for action\nTrying to film everything off-axis",
        "Starting to focus on male actor from beginning\nDeliberately keeping wrong composition of male being tight in corner, to get the emotion of his character being out of balance\nBeing honest and not working against the scene\nAmplifying the emotion [ambiguity - the mentally feeling pushed into a corner the male experiences according to him] by the wrong composition ['manipulating the audience's emotion' by amplifying it]\nTrying to film everything off-axis\n",
        "Moving to the left, filming him over her shoulder\nTrying to film everything off-axis",
        "Trying to film everything off-axis",
        "Going quite close to male while moving slightly to left, showing his facial expressions\nNot going closer than medium shot\nTrying to film everything off-axis",
        "Doing a shaky move, tilting down to amplify him moving around, mimicking him, to portray the energy and have the same energy as him.\n[but it probably resulted in me being too off-axis to show his emotions properly]\nPortraying the energy and have the same energy as him [which probably results in him being off axis]\nTrying to film everything off-axis",
        "Trying to film everything off-axis",
        "Letting them do their movements and not doing too much myself",
        "Moving really close, showing male's emotions\nTrying to have ending less off axis than what came before",
        "Going closer to the eye line\nLetting them play it out as long as they have the stamina for it\nTrying to have it as intimate as possible, or the most intimate parts of the scene.\nTrying to have the ending less off axis than what came before.",
        "Showing him conforting her with his hand by moving in the camera so we can see him doing it.\nTrying to have the ending less off axis than what came before.",
        "Letting them play it out as long as they have the stamina for it\nCutting it when eventually there was this ending that could have gone on forever.\nCutting the emotion I want to convey plus a little more for editing.",
        "",
        ""
    ]
  ],
  "s4_SHE": [
    [
        "Timestamp",
        "-00:30 - minus 13s",
        "-00:13 - 00:00",
        "00:00 - 00:05",
        "00:05 - 00:13",
        "00:14 - 00:27",
        "00:28 - 00:32",
        "00:33 - 00:57",
        "00:58 - 01:01",
        "01:02 - 01:04",
        "01:04 - 01:06"
    ],
    [
        "Description of Phase",
        "Rehearsing with the camera",
        "Preparing for shooting",
        "Following the actress",
        "Reading each other at the pause after the shoes, deciding what to do next",
        "Following her towards the window in a wide shot, showing male entering but remaining focused on her\n",
        "Starting the end shot; dealing with technicalities of trying to not create a shadow; taken out of story",
        "Filming hands part of endshot",
        "Continuing end shot in closeup",
        "Confusion about what is happening, very focused on her eyes",
        "Getting it is a joke; capturing the power of their turn"
    ],
    [
        "video_time_stamp",
        "-00:30",
        "-00:13",
        "00:00",
        "00:05",
        "00:14",
        "00:28",
        "00:33",
        "00:58",
        "01:02",
        "01:04"
    ],
    [
        "Thoughts",
        "Thinking about how am I going to do this shot",
        "-",
        "-",
        "-",
        "It is important for the story to show the guy also.",
        "Starting to think about the shadow I am creating",
        "-",
        "-",
        "-",
        "Figuring they agreed on it\nFiguring they are playing a joke on me, trying to make me laugh\nWondering if this is the story\nFiguring it is part of the film probably and not 100% mistake\n\"\"It's over\"\""
    ],
    [
        "Other mental processes / states",
        "Looking at possible compositions and lighting at key points of frames\nLooking at dymanics I would like to have story-wise\nExperience comes in, I don't think about it, bits and pieces I have done before\nLaying down basics of don't shoot where there is no set, Actors coming and going from here to here, ending up in this shot, what happens in meanwhile [a couple of anchors]\n[During first two takes had been looking for solution of the scene]\nMore natural process of knowing I have to move around a lot and where I have to move fast, how I need to move my legs and cross my legs, walking sideways [it comes secondary to thinking about how I am going to do this shot]",
        "I know in my head how it's going to play out\nI know we already have one good enough take, so I am free to make mistakes if they happen\nFeeling ready in the sense of knowing what to do next\nPreplanned in my head, but feeling like freestyle\nReady for freestyle [as prepared during phase A0]\nFixing the decision of getting set\nKnowing what you are going to do next",
        "Noticing actress and me are connected from moment she walks in [that's why it feels right]\nNoticing actress and me lock our dynamics/tempos\nNoticing actress and me are moving in tandem, at same pace and mirroring each other [he does this sunconsciously]\nNoticing only me and her in the empty shot, starting together [this part of the connection]\nFeeling her [=seeing through the frame] reading the room, feeling the camera, giving the right emotions in the right direction\nFeeling [= seeing through the frame] that she knows I am there and she knows what I am going to do as well. Minor details in facial expression and body language tell me that.\nI feel that she knows eactly what kind of shot this is, and she is playing for that\nReading each other: being physically very close, and optically feeling in the room the energy I see in the shot [subconsiously you know what is going on since you are so close]\n[this dialogue being in both our subconscious]",
        "-",
        "Wanting to go with her to the window and ignore the guy completely\nA bit wide to my liking but that's the restrictions.\nKnowing it won't work perfectly with the male entering, but also knowing I can't make it better\nKnowing my solution is not the only one, but it is just with the last take.\nStill connected with her\nDynamics are working\nWanting to go back to a closeup of her as soon as possible",
        "Taken out of the story for split second by technicalities of trying to prevent own shadow entering frame while keeping frame at same time\nKnowing I can't make it better with the shadow\nSubconsciously trying to get rid of it\nKnowing I can't go closer because I will create more shadow\nFinding them too equal in the end [because of needing to prevent shadow]\nNoticing actors are freestyling and not doing what he asked them beforehand, to help prevent shadow\nSeeing the shadow of the camera, aware that the audience might see it too, taking them out of the story\nStill hoping audience would not see the shadow",
        "-",
        "-",
        "Not sure if she is looking dead into camera or just next to it, is it a mistake or not?\nRealising she is breaking 4th wall as it continues, while had been waiting for her to fix her position 2 degrees off camera\nNot sure which way she is going to go style-wise",
        "Surprise\nIf I am less dynamic (with the camera), the moment they give us is more powerful"
    ],
    [
        "Feelings / emotions",
        "Routing for the girl throughout the scene, as DOP and as me -->",
        "Feeling ready to move accordingly when actress comes in",
        "Rhythm feels right from beginning\nFeeling in the room the energy I see in the shot (and what he sees about her knowing, reading and feeling?)\n",
        "-",
        "A bit wide to my liking\nHappy with the choice to stay on her and letting him enter wide frame.\nStill connected with her",
        "Feeling forced to end the film in a way that suggests they are going to be fine [because forced to film them too equal for his taste]\nNot empathising with characters at all because of dealing with technicalities; actors were persons to me",
        "-",
        "-",
        "Not getting the emotion as it (her look) was on the line\nGetting a confused emotion.",
        "Feels like they want to do something funny because it is the last take\nFeeling their turns as very powerful\nFeels like the end of a project, like we have been doing this a long time\nAs if ending long feature film, last day of shooting\nSadness\nHappy\nRelieved\nFeeling intimate with actors [because of freestyling both ways and emotional scene]"
    ],
    [
        "Body actions, sensations, events",
        "[not practising with body in the room, not needed with this simple choreography, and positioning legs comes from experience]",
        "Keeping pulse steady and calm",
        "[ongoing during shoot]: \n- Trying not to step too harsh\n- Trying to be smooth so my steps are invisible in camera movement\n- Keeping steady and stable\n- Aware of connection points between me and camera as we are like one piece together.\n-->",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    [
        "Actions (decisive, filming)",
        "Moving out with the camera, looking at possible compositions and lighting at key points of frames",
        "(He stands against the left wall, very still, camera focused on space where actress will enter)",
        "Starting with this pan motivated by the actress",
        "(Keeping camera still, on her)",
        "Going to a wide shot to show the guy while staying with her as she moves to window, making him foreground noise to the girl [which works for the story as it reflects the state of the girl, as decided before shooting. This is the safe for this weak point of the scene logistically and choreographically]\nNot giving him attention while keeping him in the frame.",
        "Having to move physically because of the shadow\nHaving to compromise the composition this way.\nKeeping the frame whilst trying to prevent shadow\nAngling himself more toward side profiles, because going more on the girl would create more shadow on her\nTrying to make it like the camera shadow could have been the shadow of the male.",
        "Staying just wide enough so hand gestures are visible; not showing them directly",
        "-",
        "Waiting for her to fix her position 2 degrees off camera, but she is keeping it straight\nWatching her eyes very precisely",
        "Keeping the shot, not starting laughing, finishing it.\nHandling it calmly\nBeing like a tripod in this moment, not moving at all"
    ]
  ],
  "s5_SHE": [
    [
        "Timestamp",
        "-01:00 - minus 33s",
        "-00:33 - minus 11s",
        "-00:11 - 00:01",
        "00:01 - 00:05",
        "00:06 - 00:13",
        "00:13 - 00:17",
        "00:17 - 00:19",
        "00:20 - 00:23",
        "00:24 - 00:35",
        "00:36 - 00:51",
        "00:52 - 01:04",
        "01:05 - 01:10"
    ],
    [
        "Description of Phase",
        "Mentally preparing for the shoot, after take 2",
        "(Clapboard part)",
        "Getting into position - Impulse of changing the starting frame",
        "Trying to be with actress' impulses",
        "'Sneakily' getting closer to the actress",
        "Being in sync with actress moving to window",
        "Getting him in",
        "Following him picking up the shoes",
        "Focusing back on her",
        "Preparing for endshot? (undiscussed, but not yet endshot)",
        "End shot",
        "Continuing shooting a bit more, going wider"
    ],
    [
        "video_time_stamp",
        "-00:59",
        "-00:33",
        "-00:11",
        "00:01",
        "00:06",
        "00:13",
        "00:17",
        "00:20",
        "00:24",
        "00:36",
        "00:52",
        "01:05"
    ],
    [
        "Thoughts",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    [
        "Other mental processes / states",
        "Going through the shot in my head, understanding that someone looking at it might not get all the information happening that could be needed to tell the story\nThinking I am not telling the full story with that shot\nThinking maybe his entrance is needed to tell the full story\nThinking about how the shot would be seen\nThinking about what is actually happening\nThinking about what story I am telling with the images\nVisually seeing it in front of me = thinking, not separated\nWondering how to get it but still stay close\nFiguring out when to get him in, planning that.\nOnly thinking about scene [not actively aware of surroundings]\nRunning out of things to think",
        "-",
        "-",
        "-",
        "Thinking ahead, when to do what, where is my balance? When should I be ready to do the pan?",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "Wanting to see what will happen so composing a bit more of him in"
    ],
    [
        "Feelings / emotions",
        "Feeling I am missing something - his entry\nFeeling like emotionally, it was there\nBut story-telling wise, we are missing his entry\nSeeing in head is connected to places I am looking at\nPhysical points in studio I have seen are connected with memory of shooting it\nMentally being there in that moment, like a collection of attention points and maybe some beats. Moments in time that were concentrated on by the frame that I chose or want to choose.\nIntending to get those moments.\nNot actively aware of surroundings [only thinking about the scene]\nRunning out of things to think\n",
        "-",
        "Not sure about how I filmed the legs last time\nImpulse [not fully thinking]: \"\"Let's not do the feet thing, let's try it in a normal way again\"",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Feeling I need to do this thing differently again",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Feeling of an impulse that pushes me somewhere else",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "Feeling of unease",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    [
        "\"This I have already done, maybe there is something better here\"\" [not full thinking]\nA continuation of a search, focusing on the floor or not.",
        "Understanding that the position the frame shows is too far away [connected to lens choice - not being adapted to that]",
        "Stayed wider than I wanted\nHere I feel closeup is better: something is going on in the eyes [which I saw during rehearsals already], this conflict, dread, thinking - I saw her thoughts forming and changing\nWanting to get closer to create same impact as on take 2\nConflicting choices [always]: Wanting to get the shot I want, while doing it in a way that does not show the camera\nKnowing if I want to get closer, I have to do it sneakily\nGetting ready for her moving towards the window\nKnowing when she arrives, I need to be ready for him\nKnowing I have to step back to get him in once she has moved to the window.\nSome planning for it becoming more technical after she leaves as I will not be focused on minute eye movements anymore, but rather following the action.\nGetting ready is trying not to sleep, to be fast reacting and move in sync with or slightly later than actors",
        "Be awake as much as possible",
        "I know I have to get him in\nI know I am on the wrong axis for the shoes, I need to move away from the shoes",
        "I sense that I am missing the comment on the situation, which is more interesting, the comment that she gives by her presence, rather than his actions.\n[Her underlying take on the situation, her emotional reaction or emotional view on it, or even conscious view on it, is more interesting, you need to see the minute closeup for that.]",
        "Realizing this side is not working well for me [her direction doesn't work in dialogue like with his direction]",
        "-",
        "-",
        "It gave a new feeling\nI am aware of the frame mostly, trying to feel where is the organic way of stopping, where it starts to stay still for my sense.\nKnowing I captured their input.\nFeeling that it is complete for this when calling cut\nI sense the rhythm of the scene and feel it in the frame; feeling the beats, the intensity, and the process in the same way in between those beats [this moment and talking generally.]",
        "",
        "",
        ""
    ],
    [
        "Body actions, sensations, events",
        "Feeling happy about her performance during previous take\nFeeling of let's do it!\n",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "It gave a new feeling"
    ],
    [
        "Actions (decisive, filming)",
        "Seeing it in front of me is located in the head",
        "-",
        "-",
        "-",
        "Keeping myself on my toes, to not get comfortable\nKeeping legs bent and trying to move hips as little as possible\nTrying to stabilise own movements as much as possible",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    [
        "-",
        "-",
        "-",
        "Deciding to change the starting frame, finding a new position where you feel more comfortable",
        "Trying to be with actress' impulses\nTrying to get her eyeline, close to the lens but not fully in the lens, to see her eyes the best\nGetting closer to her eyes, see more into what she is thinking at.",
        "Deciding to concentrate on what is happening in her eyes [as it is what I am the most interested in]\n[but not spontaneous responding - already knew she will provide something interesting]\nTrying to get closer\nNothing very concrete, just trying to follow the scene and the impulses the actors give me\nKeeping camera as still as possible and move in one direction as smoothly and slowly as possible\nAs still as possible, but moving in",
        "When she starts moving I push my weight to the side she starts moving and try to be fast. [like falling, like with basic walking]\nTrying to be in sync with her movements as much as possible",
        "I pan to him as fast as possible\nStart walking back as fast as possible [because I know I am on the wrong axis for the shoes, I need to move away from the shoes]",
        "Walking backwards to corner of the room and following him\nShowing him picking up the shoes\nFollowing him for a while [made that decision before shooting, because it was something I hadn't done before. Felt that staying with her is better, but I should do a version where I capture his actions more. The idea being to show the complete story more, the basic mise-en-scene, even if for my sense not the best way to get the feeling of the situation. Because idea was to get it from her perspective, so I want to see her more, not what she sees, for me that was more interesting]\nI am trying to do the best of this version [you can't go back and forth between two options otherwise it is about nothing]\nTrying to show the basic mise-en-scene literally, so we see all elements of what is happening.",
        "Moving 1 metre to the right and turning to the left at the same time, from bedroom towards window\nHaving him also in the shot being positioned next to him now",
        "-",
        "Trying to keep the assignment [although I would like to end with her closeup]\nTaking a very cut-off two shot of him [as she is the main character in the shot]\n[very conscious decision from her first take onwards to focus on her mostly but also keep him in, but the latter only because it was the assignment]",
        "Going a bit wider to show him a tiny bit more\nTo show the beat better, but still focus on her\nI capture their input"
    ]
  ],
  "s6_SHE": [
    [
      "Timestamp",
      "-00:00:46 to -8s",
      "-00:00:08 - 00:00",
      "00:00 - 00:10",
      "00:10 - 00:20",
      "00:20 - 00:23",
      "00:24 - 00:26",
      "00:27 - 00:37",
      "00:38 - 1:09",
      "01:09 - 01:12",
      "01:12 - 01:21"
    ],
    [
      "Description of Phase",
      "Trying to be comfortable in body, ready for reaction",
      "Capturing her rushing in and picking up the shoes",
      "Capturing her rushing in and picking up the shoes",
      "(Her moving to the window - undescribed phase)",
      "She looks at him, following his movement with her eyes and face",
      "Blocking her accidentally, in hindsight reinforcing her being suffocated by him",
      "Catching him putting down the shoes and giving them back the space, all the while moving towards end position",
      "More freestyle phase, exploring their connection in final positions and how to end shoot",
      "Not responding to male actor looking into camera",
      "Responding to actors' surprise"
    ],
    [
      "video_time_stamp",
      "-00:46",
      "-00:08",
      "00:00",
      "00:10",
      "00:20",
      "00:24",
      "00:27",
      "00:38",
      "01:09",
      "01:12"
    ],
    [
      "Thoughts",
      "Focused on the action\nFocused on matching my movements with her movements and intentions\nImagining her movements\nSpecifically concerned about moment she takes her shoes off, which I want to capture. And how to go back up to her face after.\n[As it requires a complicated movement]",
      "-",
      "When down on the shoes, moment of doubt about when to go up\nAnticipating her reaction to male appearing\nKnowing next action I want to catch is him putting shoes on the table.",
      "-",
      "I don‚Äôt want to catch him picking up the shoes\nI want to catch him putting shoes on table",
      "Okay, now I need to rotate to her back and do it in a way that feels organic with her movements\nSo I can pan down and catch him putting the shoes on the table\nWanting to catch the flare from the window light\nWanting to use the verticality of the window to show division between them\nIn the back of his mind are religious/symbolic  imagery/ themes/ geometry\nKnowing it is going to be tricky with the space as I block her\nDeciding to still do it\nKnowing/trusting she will solve it professionally as actress",
      "Waiting for important line [Your friends don't like me]\nJust waiting for that action of the line, muting the content of the sentence\nI could be on him, but I want to be with her and see how he is approaching",
      "Not very planned\nKeeping possibiities open, also in terms of distance\nI know I am between closeup and midshot and that I am going to be between proile and 3/4 frontal of her and also want to be on him, (so I am reacting to that)\nNot thinking that I am only going to be on her\nSeeing, what is their connection?\nStarting to explore how to end the shoot\nAnd getting ready for closing part of scene.",
      "-",
      "Realising they have an agreement or indication\nI will try to reinforce this action"
    ],
    [
      "Other mental processes / states",
      "Visualising, like previewing, looking at the space, imagining her movements in it\nTrying to imagine how the object is going to be in the frame, what lines I will see in background, what I will see in background and foreground",
      "Trying to be alert, ready",
      "Knowing her picking up the shoes is coming",
      "-",
      "-",
      "Realising I am blocking her as I take long step back\nVery alert of the frame to catch a religious theme in the geometry, giving the light flare a toxic meaning, representing his power",
      "Main focus is to keep them on frame",
      "Seeing, what is their connection?\nDiscovering things (by relaxing in the body and keeping a flow of movement, and keeping moving)\nStill very alert, even more in this flow state [because I have to be responsive]\nCompletely invested in the present, what is happening in the frame. Just-past and planning next are not present\nMore concerned with having them on frame correctly under my rules of composition, than with their expressions.",
      "No surprise [it happens all the time, not surprising in itself]\nFocused on composition",
      "My concentration breaks a little [perhaps by persona of actor appearing, or the geometry]"
    ],
    [
      "Feelings / emotions",
      "-",
      "-",
      "Immediately when she comes in, I feel it works",
      "-",
      "-",
      "Feeling her confusion for a moment\nI feel she is acknowledging my presence with her body",
      "-",
      "Feeling good\nFeeling excited to discover new possibilities of a scene",
      "Didn't feel that much",
      "Did not feel surprise\nI feel I have to take distance from them"
    ],
    [
      "Body actions, sensations, events",
      "Rehearsing my movements\nImagining how it feels, the movements I would do, how low I would go with camera\nFeeling where my elbows touch my stomach, so I know this is the limit\nPhysically making movements to the window\nDeliberately hitting the table so body knows this is the limit",
      "Trying to be comfortable in the body",
      "-",
      "-",
      "I am physically very close to her",
      "Realising I am blocking her as I take long step back",
      "-",
      "Sense of flowing, keeping in movement, also in how I move the camera\nI feel it all around the body, trying to relax all muscles, the knees, the stepping, the hips, moving a little from side to side, in an out",
      "-",
      "Body translates surprise by stepping back, it is a bit like their looking pushes me back"
    ],
    [
      "Actions (decisive, filming)",
      "Exploring with the viewfinder, what I can see, and what I can see with my eyes",
      "-",
      "Starting to move at same time as her, following her\nGoing very fast down with her picking up the shoes\nWhen nothing else is happening down with the shoes, going up to her face\nTrying to go more of a profile of her in order to take her reaction when male comes in",
      "Capturing her moving to window while moving with her, catching her response up close when he enters",
      "I am physically very close to her",
      "As I rotate, I take one long step back [as I want to catch the light from the window to create a flare]\nPlaying around with the light and the division the window can give between them",
      "Catching him putting down the shoes on the table\nAll the while moving, turning with her, and stepping back, giving them back their space\nKeeping moving towards closeup twoshot he wants to take when she delivers line\nReacting to their actions\nKeeping them on frame",
      "Rotating from the corner to have them together already in similar position of the ending\nMoving back and forth\nPanning alternatively between him and her\nMore freestyling from this moment on\nPlaying a little with the action, not very planned, reacting to what I see\n(I know I am between closeup and midshot and that I am going to be between proile and 3/4 frontal of her and also want to be on him,) so I am reacting to that\nLetting things open, also in terms of distance",
      "-",
      "Deciding to take a couple of steps back, matching their action and that distance the looking at the camera represents"
    ]
  ]
}
